<a href="https://colab.research.google.com/github/robajo12/data_analytics_2/blob/main/Python/Unit%203%20-%20Python%20Advanced/Assignments/Unit3_Python_Advanced_Pandas_DataWrangling_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment 1 : Python Data Analysis using salaries dataset

# Data Exploration:  This should include summary statistics, means, medians, quartiles, or any other relevant information about the data set.

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/Salaries.csv')

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
# 397 rows = 397 employees
df.shape

(397, 7)

In [5]:
df.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [6]:
df.tail()

     Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
392         393      Prof          A             33           30  Male  103106
393         394      Prof          A             31           19  Male  150564
394         395      Prof          A             42           25  Male  101738
395         396      Prof          A             25           15  Male   95329
396         397  AsstProf          A              8            4  Male   81035

In [7]:
df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

# Mean/median of all salaries

In [8]:
# Mean of all salaries
df['salary'].mean()

113706.45843828715

In [9]:
# Median of all salaries
df['salary'].median()

107300.0

# Median salary between gender and/or rank(title) Etc...

Making a new Data Frame that only has the columns 'sex' and 'salary'

In [10]:
df1 = df[['sex','salary']]
df1.head(20)

       sex  salary
0     Male  139750
1     Male  173200
2     Male   79750
3     Male  115000
4     Male  141500
5     Male   97000
6     Male  175000
7     Male  147765
8     Male  119250
9   Female  129000
10    Male  119800
11    Male   79800
12    Male   77700
13    Male   78000
14    Male  104800
15    Male  117150
16    Male  101000
17    Male  103450
18    Male  124750
19  Female  137000

Finding the Median salary for all males

In [11]:
df2 = df1[df1['sex']=='Male']
df2.head(20)

     sex  salary
0   Male  139750
1   Male  173200
2   Male   79750
3   Male  115000
4   Male  141500
5   Male   97000
6   Male  175000
7   Male  147765
8   Male  119250
10  Male  119800
11  Male   79800
12  Male   77700
13  Male   78000
14  Male  104800
15  Male  117150
16  Male  101000
17  Male  103450
18  Male  124750
20  Male   89565
21  Male  102580

In [12]:
df2['salary'].median()

108043.0

Finding the Median salary for all females

In [13]:
df3 = df1[df1['sex']=='Female']
df3.head()

       sex  salary
9   Female  129000
19  Female  137000
24  Female   74830
34  Female   80225
35  Female   77000

In [14]:
df3['salary'].median()

103750.0

In [17]:
Male_mean = round(df2['salary'].mean(),2)
Male_mean

115090.42

In [19]:
female_mean = round(df3['salary'].mean(),2)
female_mean

101002.41

Comparing the Mean salary of Males and Females

In [15]:
# The difference between mean salaries of male and female
difference1 = round(df2['salary'].mean() - df3['salary'].mean(),2)
difference1

14088.01

# Data Wrangling – perform some basic transformations on the data

People who have 20 years of experience (Total: 157), (Mean Salary: 122,520.66)

In [70]:
Atleast_twenthy_yearsExp_df = df[df['yrs.service']>=20]
Atleast_twenthy_yearsExp_df.count()

Unnamed: 0       157
rank             157
discipline       157
yrs.since.phd    157
yrs.service      157
sex              157
salary           157
dtype: int64

In [57]:
averageSalary1= Atleast_twenthy_yearsExp_df['salary'].mean()
print('averageSalary1: ',round(averageSalary1,2))

averageSalary1:  122520.66

Comparing the salaries of people who have 20+ years of experience vs less than 20 years of experience

In [60]:
less_twenthy_yearsExp_df = df[df['yrs.service']<20]
less_twenthy_yearsExp_df

     Unnamed: 0       rank discipline  ...  yrs.service     sex  salary
0             1       Prof          B  ...           18    Male  139750
1             2       Prof          B  ...           16    Male  173200
2             3   AsstProf          B  ...            3    Male   79750
5             6  AssocProf          B  ...            6    Male   97000
9            10       Prof          B  ...           18  Female  129000
..          ...        ...        ...  ...          ...     ...     ...
390         391       Prof          A  ...           19    Male  166605
391         392       Prof          A  ...           19    Male  151292
393         394       Prof          A  ...           19    Male  150564
395         396       Prof          A  ...           15    Male   95329
396         397   AsstProf          A  ...            4    Male   81035

[240 rows x 7 columns]

In [65]:
averageSalary2= less_twenthy_yearsExp_df['salary'].mean()
print('averageSalary2: ',round(averageSalary2,2))

averageSalary2:  107940.5

In [67]:
difference2 = round(averageSalary1- averageSalary2, 2)
difference2

14580.15

People who have salary of greater than or equal to 200,000

In [20]:
greaterThan200K = df[df['salary']>=200000]
greaterThan200K

     Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
43           44  Prof          B             38           38  Male  231545
249         250  Prof          A             29            7  Male  204000
364         365  Prof          A             43           43  Male  205500

In [25]:
greaterThan200K.count()

Unnamed: 0       3
rank             3
discipline       3
yrs.since.phd    3
yrs.service      3
sex              3
salary           3
dtype: int64

Your Findings here...

=>  Professors who have less than 20 years of experiences have a salary which is closed to the median of all salaries.

=> People who have salary of greater than or equal to 200,000 may be considered as outliers because their salaraies are almost twice the mean of all salaries.

=> From the data, I found that there are three outliers(all males) that may have influenced the mean of salary of males.

# Rename values, subset columns, etc

In [ ]:
# Removing the columns 'Unnamed: 0'  
df4 = df.drop(['Unnamed: 0'], axis=1, inplace=True)

In [49]:

df5= df
df5

         rank discipline  yrs.since.phd  yrs.service   sex  salary
0        Prof          B             19           18  Male  139750
1        Prof          B             20           16  Male  173200
2    AsstProf          B              4            3  Male   79750
3        Prof          B             45           39  Male  115000
4        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
392      Prof          A             33           30  Male  103106
393      Prof          A             31           19  Male  150564
394      Prof          A             42           25  Male  101738
395      Prof          A             25           15  Male   95329
396  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]

# Create some simple visualizations showing some simple statistics

Your observations from the visuals:

# Draw some conclusions based on the data.  What did you discover?

Based on the analysis performed above, the conclusions are as follows:

Your Findings here...



I also discovered that the -

 Your Findings here...